In [1]:
from pathlib import Path
import pandas as pd
import numpy as np

In [2]:
with Path("day-01-puzzle-input.txt").open() as file_obj:
    puzzle_input = file_obj.read()

df = pd.DataFrame(puzzle_input.split('\n\n'), columns=('Calories',))
df.head()

                                            Calories
0        7769\n6798\n11685\n10826\n11807\n5786\n7932
1                                              54883
2  7069\n5792\n1519\n7380\n7034\n6203\n5706\n1850...
3  9150\n6417\n5057\n3568\n9352\n7134\n6040\n2451...
4               10996\n11802\n5525\n5705\n8266\n3742

In [3]:
df['Calories'] = df['Calories'].str.split('\n')
df.head()

                                            Calories
0      [7769, 6798, 11685, 10826, 11807, 5786, 7932]
1                                            [54883]
2  [7069, 5792, 1519, 7380, 7034, 6203, 5706, 185...
3  [9150, 6417, 5057, 3568, 9352, 7134, 6040, 245...
4             [10996, 11802, 5525, 5705, 8266, 3742]

In [4]:
def clean_calories(value):
    value = np.array(value)
    return value.astype(np.int32)

df['Calories'] = df['Calories'].apply(clean_calories)
df.head()

                                            Calories
0      [7769, 6798, 11685, 10826, 11807, 5786, 7932]
1                                            [54883]
2  [7069, 5792, 1519, 7380, 7034, 6203, 5706, 185...
3  [9150, 6417, 5057, 3568, 9352, 7134, 6040, 245...
4             [10996, 11802, 5525, 5705, 8266, 3742]

**Part One**

In [5]:
df['Total'] = df['Calories'].apply(np.sum)
df.head()

                                            Calories  Total
0      [7769, 6798, 11685, 10826, 11807, 5786, 7932]  62603
1                                            [54883]  54883
2  [7069, 5792, 1519, 7380, 7034, 6203, 5706, 185...  63535
3  [9150, 6417, 5057, 3568, 9352, 7134, 6040, 245...  51464
4             [10996, 11802, 5525, 5705, 8266, 3742]  46036

In [6]:
df['Total'].max()

71780

**Part Two**

In [7]:
df = df.sort_values(by="Total", ascending=False)
df.head()

                                            Calories  Total
34   [9739, 11547, 11940, 10268, 11939, 10825, 5522]  71780
224                            [24591, 21630, 25260]  71481
75                                           [69228]  69228
121                                   [33797, 34907]  68704
148        [13509, 11975, 12287, 10636, 12399, 7668]  68474

In [8]:
df["Total"][:3].sum()

212489